brew 'ag'
brew 'autojmp'
brew 'bat'
brew 'ccache'
brew 'cmake'
brew 'fd'
brew 'ffmpeg'
brew 'fish'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'htop'
brew 'hyperfine'
brew 'jq'
brew 'lazygit'
brew 'ninja'
brew 'nnn'
brew 'parallel'
brew 'python'
brew 'tmux'
brew 'vim'
brew 'watch'
brew 'wget'
brew 'wine'

tap 'homebrew/homebrew-cask'

# general mac

cask '1password'
cask 'alfred'
cask 'appcleaner'
cask 'daisydisk'
cask 'google-chrome'
cask 'omnifocus'
cask 'rectangle'
cask 'roam-reseach'
cask 'the-unarchiver'

# dev

cask 'dash'
cask 'fork'
cask 'iterm2'
cask 'visual-studio-code'

# other

cask 'dropbox'
cask 'evernote'
cask 'gimp'
cask 'obs'
cask 'spotify'
cask 'vlc'
cask 'zoom'

## music stuff

# cask 'ableton-live-suite'
# cask 'affinity-photo'
# cask 'blackhole-2ch'
# cask 'docker'
# cask 'google-drive'
# cask 'loom'
# cask 'notion'
# cask 'rekordbox'
# cask 'splice'
# cask 'tageditor'
# cask 'touchdesigner'
